Tekla Open API Reference for Tekla Structures 2025
Events.ViewClosedDelegate Delegate
 The delegate to use for view closed event.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ViewClosedDelegate(
	int viewId
)
Public Delegate Sub ViewClosedDelegate (
	viewId As Integer
)
Parameters
viewId
Type: System.Int32
The view id of the clip plane.
See Also
Reference
Tekla.Structures.Model Namespace